{
            "ingredients": [
                {
                    "label": "all purpose flour",
                    "measurement": "315g"
                },
                {
                    "label": "Diamond kosher salt",
                    "measurement": "1 tsp"
                },
                {
                    "label": "Country Crock Plant Butter Sticks",
                    "measurement": "6T",
                    "measurement_alt": "85g",
                    "note": "the smaller you cut it up the faster you can incorporate it"
                },
                {
                    "label": "Crisco Vegetable Shortening",
                    "measurement": "230g",
                    "note": "DO NOT portion this ahead of time - put it directly into the flour in step 2"
                },
                {
                    "label": "ice cold water",
                    "measurement": "1/2 cup"
                }
            ],
            "instructions": [
                {
                    "step": "Whisk your flour and your salt together in a bowl."
                },
                {
                    "step": "Weigh directly into the flour the butter and the vegetable shortening. They're both greasy and soft and sticky and you'll lose a portion to your scoops / spoons / measuring tools, so if you put it directly into the flour you get it all in there... and you have less greasy dishes to clean."
                },
                {
                    "step": "Stir the bowl contents enough so that flour coats all the fat, then dump the bowl out onto a cleaning surface."
                },
                {
                    "step": "Using a fork or two forks or a bench knife or whatever you want, your fingers you mad lad, cut the butter / shortening combo into smaller pieces. You want something coarse and pebbly - some bigger chunks are okay."
                },
                {
                    "step": "Drizzle the water onto the dough and then stir until it clumps a bit and all the water is mixed in. There will be a lot of dry flour still - this is okay!"
                },
                {
                    "step": "The odds are now against you. If you handle this too much with your hands, the heat will melt both the butter and shortening and turn you into a glistening mess. Using the bench knife and floured hands, you want to fold the dough onto itself. By folding, you're making layers of fat and flour that will result in a flaky pie crust. You can always add some more flour. Use the bench knife to scrape your surface to release stuck fat."
                },
                {
                    "step": "Once essentially all combined, some leftover chunks still okay, wrap it in plastic tightly and whack it into the freezer for a bit. The plant butters need the extra cold to really thicken up so you can roll this out easily."
                }
            ]
        }